/**
 * 安卓白金英雄坛制作组 <p>
 * 文件名：Gesture.java <p>
 * 创建时间：2013-8-7 上午10:24:47 <p>
 * 所属项目：GmudTest <p>
 * @author 12548 <p>
 */
package lostland.gumd.platinum12548.data;

import lostland.gumd.platinum12548.GmudWorld;

/**
 * 类名：Gesture <p>
 * 说明：招式类
 * @author 12548
 */
public class Gesture {

	public static boolean b = true;

	public Gesture() {
		// TODO 自动生成的构造函数存根
	}

	public int llimit;                       //等级限制
	public int force1;                    //兵刃威力
	public int force2;                   //拳脚威力
	public int dmg_type;              //伤害类型
	
	public int dmgfix;                 //受伤系数
	public int hitfix;                    //命中加成
	public int forcefix;                //威力加成
	
	public String c;                      //内容字符串
	
	public static int zsc = 0;
	
	private static void setGesture(int i1,int i2,int i3,int i4,int i5,int i6,int i7,int i8,int i9,int i10,int i11,int i12,String s)
	{
		GmudWorld.zs[zsc] = new Gesture();
		GmudWorld.zs[zsc].llimit = i1;
		GmudWorld.zs[zsc].dmg_type = i2;
		GmudWorld.zs[zsc].dmgfix = i4>127?i4-255:i4;
		GmudWorld.zs[zsc].hitfix = i5>127?i5-255:i5;
		GmudWorld.zs[zsc].forcefix = i6>127?i5-255:i5;
		GmudWorld.zs[zsc].force1 = i8*256+i7;
		GmudWorld.zs[zsc].force2 = i10*256+i9;
		GmudWorld.zs[zsc].c = s;
		zsc++;
	}
	
	public static void init()
	{
		zsc = 0;
		setGesture(0, 1, 0, 0, 0, 0, 40, 0, 0, 0, 21, 71,"$N一招「回身劈山刀」左足踏上一步,蓦地里横刀转身,呼的一声,向$n$1削去"); //0
		setGesture(19, 1, 0, 0, 0, 0, 50, 0, 0, 0, 89, 71,"$N踏前数步「上步劈山」,刀带劲风由上而下劈向$n");
		setGesture(29, 1, 0, 5, 0, 0, 60, 0, 0, 0, 135, 71,"$N双手抱刀,急退两步翻身跃起,一招「童子拜佛」力劈$n");
		setGesture(39, 1, 0, 0, 0, 0, 75, 0, 0, 0, 186, 71,"$N一招「朝阳刀」直劈$n$1,刀身带动劲风直刮得$n耳边生疼");
		setGesture(49, 1, 0, 5, 0, 0, 80, 0, 0, 0, 240, 71,"$N一招「削耳撩腮」舞个刀花,$n上盘要害尽被笼罩");
		setGesture(59, 1, 0, 10, 0, 0, 90, 0, 0, 0, 30, 72,"$N急踏两步,一招「上步撩刀」由下而上撩向$n小腹");
		setGesture(69, 2, 0, 0, 0, 0, 50, 0, 50, 0, 76, 72,"$N刀交左手,「仙人指路」直刺$n,同时右手骈指点向$n$1");
		setGesture(79, 2, 0, 0, 0, 0, 120, 0, 0, 0, 127, 72,"$N一招「夜叉探海」竟以刀做剑,中宫直进刺向$n");                                      //7
		setGesture(0, 4, 0, 5, 0, 0, 0, 0, 80, 0, 245, 72,"$N一招「背心钉」转到$n身后一掌猛向$n背心灵台穴拍去");
		setGesture(0, 4, 0, 0, 0, 0, 0, 0, 60, 0, 40, 73,"$N一招「游空探爪」,飞起身形自半空中变掌为抓锁向$n$1");
		setGesture(0, 4, 0, 0, 0, 0, 0, 0, 40, 0, 92, 73,"$N大喝一声身形下伏,一招「劈雷坠地」捶向$n双腿");
		setGesture(0, 0, 0, 15, 10, 10, 0, 0, 100, 0, 138, 73,"$N运气与掌,一瞬间掌心变的血红,一式「掌心雷」推向$n");
		setGesture(0, 4, 0, 0, 0, 0, 0, 0, 70, 0, 189, 73,"$N阴手翻起阳手跟进,一招「没遮拦」结结实实的捶向$n$1");
		setGesture(0, 4, 0, 10, 0, 0, 0, 0, 50, 0, 241, 73,"$N上步抢身,招中套招,一招「劈挂连环」连环攻向$n");                                   //13
		setGesture(0, 4, 0, 5, 0, 0, 0, 0, 80, 0, 142, 74,"$N走天阵跨乾位,使一招「天道无常」,抖臂发劲一掌攻向$n");
		setGesture(19, 4, 0, 0, 0, 0, 0, 0, 90, 0, 195, 74,"$N转地阵居坤位,一招「地震三岗」直取$n");
		setGesture(29, 4, 0, 0, 0, 0, 0, 0, 100, 0, 233, 74,"$N上风阵取巽位,一招「风起云涌」掌势变幻击向$n");
		setGesture(39, 0, 0, 5, 0, 0, 0, 0, 110, 0, 23, 75,"$N过云阵居震位,一式「云海茫茫」双掌交错击向$n$1");
		setGesture(49, 4, 0, 0, 0, 0, 0, 0, 120, 0, 71, 75,"$N脚下方位变幻,一招「飞龙居坎」左掌斜引右掌穿出,拍向$n$1");
		setGesture(59, 4, 0, 10, 0, 0, 0, 0, 100, 0, 128, 75,"$N脚踏八卦方位,一招「鸟翔归离」却步抽身双掌一前一后相继击向$n");
		setGesture(69, 4, 0, 5, 0, 0, 0, 0, 150, 0, 190, 75,"$N步法虽急但八卦方位丝毫不乱,一招「蜿盘退艮」守中带攻右掌划向$n$1");
		setGesture(79, 4, 0, 5, 0, 0, 0, 0, 180, 0, 0, 76,"$N身法越转越快,一瞬间踏遍天地风云四门,「四正四奇」连攻八掌");
		setGesture(89, 4, 0, 10, 0, 0, 0, 0, 220, 0, 59, 76,"$N默念口决,由归昧转无妄,自同人趋大有,一招「四开四阖」连出十六掌");    //22
		setGesture(135, 76, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n暗运真气,一招「龙飞凤舞」远远避了开去");
		setGesture(175, 76, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「游龙戏凤」,身影晃动早闪过一旁");
		setGesture(213, 76, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一式「龙翔在天」,急跃而起,在空中一个转折落在丈外");
		setGesture(8, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n脚步错落,暗踏梅花桩,一招「龙游掠波」闪了开去");
		setGesture(55, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n身形连晃使一招「云龙三现」,连续三个空心斛斗挑了开去");                             //27
		setGesture(123, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「乱花迷人眼」,身形微动,早已闪在一旁");
		setGesture(166, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n衣裾轻摆,一招「蝶舞绕粱归」避开这一招");
		setGesture(206, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n以手支颐,长叹一声「春深芳草尽」闪了开去");
		setGesture(248, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n使一招「山野花自红」,轻轻飘出丈外");
		setGesture(28, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n纤腰轻扭,一式「蝶逐花香语」,$N的凌历攻式尽皆落空");
		setGesture(79, 78, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n衣袖轻扬一招「花痕思愁飞」,袖中飞出绚丽花瓣,一闪而过");                            //33
		setGesture(0, 3, 0, 0, 0, 0, 40, 0, 0, 0, 220, 78,"$N使一招「山花烂漫」,手中$w划个圈子罩向$n");
		setGesture(20, 3, 0, 0, 0, 0, 50, 0, 0, 0, 6, 79,"$N展眸轻笑,一式「春花解语」,轻飘飘地向$n的$1连击数鞭");
		setGesture(40, 2, 0, 0, 0, 0, 60, 0, 0, 0, 59, 79,"$N使一招「万紫嫣红」,鞭影错落鞭势杂踏,鞭梢刺向$n的$1");
		setGesture(50, 3, 0, 5, 0, 0, 60, 0, 0, 0, 112, 79,"$N举鞭过顶手持鞭梢,一式「花落流红」,手中$w卷向$n");
		setGesture(60, 3, 0, 0, 0, 0, 70, 0, 0, 0, 161, 79,"$N使一招「飞花逐蝶」,前鞭未收次鞭又至,一瞬间连抽十几鞭");
		setGesture(70, 3, 0, 10, 0, 0, 90, 0, 0, 0, 216, 79,"$N使一招「花调无声」,$w不带一点风声抽向$n,快得不可思议");
		setGesture(80, 2, 0, 0, 0, 0, 100, 0, 0, 0, 15, 80,"$N手中$w抖得笔直,一招「花径通幽」直刺向$n,鞭到中途突然转向斜刺");     //40
		setGesture(0, 1, 0, 0, 0, 0, 20, 0, 0, 0, 164, 80,"$N使一招「春风拂人醉」,手中$w轻飘飘地向$n的$1斩去");
		setGesture(20, 1, 0, 0, 0, 0, 40, 0, 0, 0, 214, 80,"$N轻舒玉手,$w随着一招「远山伴人痴」由下而上撩往$n的$1");
		setGesture(40, 2, 0, 5, 0, 0, 40, 0, 0, 0, 12, 81,"$N身形微转,一招「飞花逐人香」$w刀光不定,刺向$n的$1");
		setGesture(50, 1, 0, 0, 0, 0, 50, 0, 0, 0, 63, 81,"$N使一招「柳叶随人笑」,迅捷无伦地劈向$n的$1");
		setGesture(60, 1, 0, 0, 0, 0, 60, 0, 0, 0, 107, 81,"$N手中$w颤动,一招「倩影惹人怜」往$n的$1斜斜砍出");
		setGesture(70, 1, 0, 0, 0, 0, 65, 0, 0, 0, 155, 81,"$N提刀轻举,一招「芦雪碎人影」劈向$n$1");
		setGesture(80, 1, 0, 0, 0, 0, 70, 0, 0, 0, 193, 81,"$N移步侧身,使一招「彩蝶灼人衣」刀光闪闪斩向$n的$1");                              //47
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 80, 0, 85, 82,"$N使一招「轻解罗裳」,对准$n的$1轻飘飘的扫去");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 60, 0, 129, 82,"$N扬起右手,一招「独上兰舟」便往$n的$1拍去");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 171, 82,"$N左手虚晃,右手「月满西楼」往$n的$1击出");
		setGesture(0, 5, 0, 0, 0, 0, 0, 0, 100, 0, 211, 82,"$N左手微分,右手一长使出一招「雁字回时」,抓向$n的$1");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 90, 0, 6, 83,"$N倏地一个转身,双手一挑「一种相思」直掼$n$1");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 150, 0, 50, 83,"$N左手虚晃,右掌飘飘,一招「两处闲愁」击向$n$1");
		setGesture(0, 5, 0, 0, 0, 0, 0, 0, 60, 0, 95, 83,"$N右手在$n$1划过,随后一招「才下眉头」左手又向同一方位抓到");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 120, 0, 153, 83,"$N左手虚晃,右手握成拳,一招「却上心头」击向$n前胸");                                //55
		setGesture(216, 83, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n展动身法,一招「鹤舞白沙」闪了开去");
		setGesture(252, 83, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「鹤舞九天」冲天而起,跃出丈外");
		setGesture(32, 84, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n使一招「梅妻鹤子」,脚下倒踩梅花桩一下绕到$N身后");
		setGesture(82, 84, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n斜身一让,一招「乳鹤归巢」斜飞数丈,脚一点地又飘了回来");
		setGesture(137, 84, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「鹤影参云」,斜飞而起,半空中一个倒卷帘轻轻落下");
		setGesture(190, 84, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「鹤隐南山」急向后退,直退出丈外,忽又如大鸟般疾扑而回");                   //61
		setGesture(0, 3, 0, 0, 0, 0, 40, 0, 40, 0, 91, 85,"$N一招「披风带雨」,手中$w搂头盖顶砸向$n");
		setGesture(19, 3, 0, 0, 0, 0, 40, 0, 80, 0, 131, 85,"$N使一招「细雨斜风」,舞动$w斜肩带背击向$n$1");
		setGesture(29, 3, 0, 0, 0, 0, 60, 0, 60, 0, 175, 85,"$N手中$w一挺,一招「八面来风」连出八杖,杖杖不离$n$1");
		setGesture(39, 3, 0, 0, 0, 0, 80, 0, 40, 0, 226, 85,"$N招式大开大阖,一式「泼墨写意」连消带打砸向$n");
		setGesture(49, 3, 0, 0, 0, 0, 80, 0, 60, 0, 16, 86,"$N一招「乱石嶙峋」,手中$w波波折折地攻向$n");
		setGesture(59, 3, 0, 5, 246, 0, 120, 0, 20, 0, 58, 86,"$N手握杖尾,$w自背后扳出,一招「断砸山」带动劲风挥向$n");
		setGesture(69, 2, 0, 10, 0, 0, 80, 0, 0, 0, 111, 86,"$N手中$w一抖,竟单凭腕力点出「画龙点睛」,杖尾刺向$n$1");
		setGesture(79, 3, 0, 5, 0, 241, 130, 0, 0, 0, 164, 86,"$N一招「弯弓射雕」,手中$w脱手飞出,如箭矢般飞击$n");                           //69
		setGesture(0, 3, 0, 5, 0, 0, 0, 0, 80, 0, 31, 87,"$N双臂直上直下连续三击,正合「击鼓三通」之拳理");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 60, 0, 77, 87,"$N一招「帝斩白蛇」,右拳变掌向$n$1横扫过去");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 40, 0, 119, 87,"$N一招「冲锋陷阵」,两拳虎口相对猛力撞向$n");
		setGesture(0, 5, 0, 15, 10, 10, 0, 0, 100, 0, 161, 87,"$N坐马沉腰,沉肩发力,一招「暮鼓晨钟」,拳劲大得异乎寻常");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 70, 0, 215, 87,"$N使一招「黄袍加身」,双拳一立垫步拧腰打向$n");
		setGesture(0, 0, 0, 10, 0, 0, 0, 0, 50, 0, 3, 88,"$N左拳虚晃,右拳一招「黑虎偷心」直捣$n胸口");                                               //75
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 40, 0, 107, 88,"$N一招「无法无天」,左手虚晃右拳直击$n前胸");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 40, 0, 149, 88,"$N右拳一立,左拳一招「无法无章」竟不按常理反向挥出");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 30, 0, 199, 88,"$N一招「无依无据」双拳连环击向$n$1");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 20, 0, 234, 88,"$N哈哈大笑,笑声中一招「无法无规」双拳分击$n右脑与后臀,实是怪异");
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 60, 0, 41, 89,"$N一招「无章可寻」,左拳后发先至右拳先发后至,齐向$n袭来");                        //80
		setGesture(110, 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「无影无踪」倏地闪在一旁");
		setGesture(141, 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n身形急转,一招「暗无天日」绕到$N背后");
		setGesture(179, 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「移形换位」,不见迈步却避到七尺之外");
		setGesture(221, 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n高蹿低伏,一式「半隐半现」一下子不见了身影");
		setGesture(9, 90, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一跺脚,一招「天魔出世」,一阵烟幕后随即不知去向");
		setGesture(58, 90, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「无声无息」,一扭身与周围景色融成一体,$N竟不知如何是好");              //86
		setGesture(0, 1, 0, 0, 0, 0, 60, 0, 40, 0, 157, 90,"$N大喝一声「牙！」,疾冲而至一刀平平地斩向$n胸前");
		setGesture(0, 1, 0, 0, 0, 0, 80, 0, 50, 0, 205, 90,"两人身形一合乍分,$N又喝道「角！」,间不容发之际劈出一刀");
		setGesture(0, 1, 0, 0, 0, 0, 90, 0, 60, 0, 4, 91,"$N运气暴喝「磷！」又是一刀从$n身后斜劈而至,实乃不可思议");                    //89
		setGesture(0, 1, 0, 0, 0, 0, 40, 0, 40, 0, 160, 91,"$N双手握刀,吐气扬声,一招「合气斩」集中全身力气斩向$n");
		setGesture(20, 1, 0, 251, 0, 0, 50, 0, 50, 0, 213, 91,"$N一招「风烈斩」,刀刃闪烁带起一股旋风,直劈$n,竟势不可挡");
		setGesture(30, 1, 0, 0, 0, 0, 50, 0, 60, 0, 13, 92,"$N忽地高高跃起,一招「落燕斩」从空中头下脚上的向$n力劈");
		setGesture(50, 1, 0, 246, 0, 0, 65, 0, 0, 0, 67, 92,"$N一招「二角罗斩」,以刀划地,疾冲向$n,两人身形交错间一道刀光斜刺飞出");
		setGesture(60, 1, 0, 251, 0, 0, 80, 0, 0, 0, 135, 92,"$N刀光闪动,竟不看$n的武功来路,一式「弧光斩」在身前划一道光弧,竟后发先至");
		setGesture(70, 2, 0, 5, 0, 0, 50, 0, 0, 0, 207, 92,"$N手中$w忽然脱手飞掷,竟然是一招「烈风手里剑」,当作暗器掷了过来");
		setGesture(80, 1, 0, 0, 0, 0, 90, 0, 0, 0, 14, 93,"$N引刀向后,忽地翻为阳手,一招「樱华斩」带起漫天花雨由下而上斩向$n");
		setGesture(90, 1, 0, 251, 0, 0, 100, 0, 0, 0, 79, 93,"$N举刀过顶,大喝一声一招「裂地斩」却砍在地上,$n正诧异间一道刀气沿地而至");//97
		setGesture(0, 2, 0, 5, 0, 0, 150, 0, 0, 0, 188, 93,"$N使出「三环套月」,左手抚剑把,右手托剑,剑尖闪动,一个圆弧向$n轻轻挑出");
		setGesture(0, 2, 0, 0, 0, 0, 180, 0, 0, 0, 1, 94,"然后$N移进一步,右手左招,左手右招,一剑接着挥出,不着一点停顿的痕迹");
		setGesture(0, 2, 0, 251, 0, 0, 220, 0, 0, 0, 66, 94,"紧接着$N手中剑又一次挥出,急点$n$1,这三剑剑势相联,剑气相叠,剑意相同");//100
		setGesture(0, 2, 0, 251, 0, 0, 20, 0, 0, 0, 121, 95,"$N右脚向前一步,左膝提起,$w向前上方划出一招「宿鸟投林」,刺向$n的$1");
		setGesture(9, 1, 0, 246, 5, 0, 20, 0, 0, 0, 187, 95,"只见$N一反身,手中$w向前划了一个大弧,使一招「流星赶月」,回劈$n的$1");
		setGesture(19, 2, 0, 251, 5, 5, 20, 0, 0, 0, 253, 95,"$N提起左腿,转身垫步,右脚跟进,一招「黄峰入洞」,$w中宫直进,刺向$n的$1");
		setGesture(29, 1, 0, 0, 0, 10, 30, 0, 0, 0, 65, 96,"$N跟进一招「燕子抄水」,$w自上而下划出一个大弧,平平地向$n的$1挥去");
		setGesture(39, 1, 0, 0, 25, 10, 30, 0, 0, 0, 130, 96,"$N摆一个左虚步,手中$w顺势划出一个整圆,一式「小魁星」撩向$n的$1");
		setGesture(49, 2, 0, 0, 10, 10, 30, 0, 20, 0, 193, 96,"$N左脚前进一步,右手$w一招「顺水推舟」,剑势绵绵,向前刺向$n的$1");
		setGesture(59, 2, 0, 0, 0, 15, 40, 0, 0, 0, 255, 96,"$N右脚后撤一步,一转身,右手$w向后反击,一招「大鹏展翅」,抹向$n的$1");
		setGesture(79, 2, 0, 0, 251, 0, 50, 0, 0, 0, 64, 97,"$N双脚并步,身体立起,双手持$w,一招「白猿献果」,向前平平刺向$n的$1");
		setGesture(89, 2, 0, 5, 246, 246, 60, 0, 0, 0, 129, 97,"$N向前连跳两步,一招「野马跳涧」,$w向前平刺两剑,点向$n的穴道");     //109
		setGesture(99, 1, 0, 5, 0, 0, 50, 0, 0, 0, 189, 97,"$N右脚向前垫步,一招「海底捞月」,$w由上向后划一个大弧,向前撩向$n的下盘");
		setGesture(109, 2, 0, 0, 0, 0, 60, 0, 30, 0, 3, 98,"$N左脚踏实,右脚虚点,一招「仙人指路」,右手$w带着一团剑花,逼向$n的$1");
		setGesture(119, 1, 0, 0, 0, 5, 70, 0, 50, 0, 70, 98,"$N微一凝神,一招「探海式」,右脚独立,左膝提起,$w向前抡劈$n");
		setGesture(129, 1, 0, 0, 5, 5, 70, 0, 80, 0, 127, 98,"$N一招「右拦扫」,一招「左拦扫」,剑锋平指,一气呵成横扫$n");
		setGesture(139, 2, 0, 0, 15, 0, 85, 0, 40, 0, 183, 98,"$N心神不乱,顺手拔出腰间$w,一招太极剑法「圆转如意」,斜斜划圈刺向$n");
		setGesture(149, 2, 0, 5, 251, 251, 95, 0, 50, 0, 249, 98,"$N向前跨上一步,左手剑诀,右手$w使出一式「指南针」,剑尖直刺$n的前胸");
		setGesture(159, 2, 0, 0, 251, 251, 115, 0, 0, 0, 59, 99,"$N一招「射雁式」,左脚跃步落地,$w回抽,不缓不急,反手勾向$n的$1");
		setGesture(169, 2, 0, 10, 251, 251, 115, 0, 20, 0, 120, 99,"$N一招「却步抽剑」,左脚跃步落地,引$n进前,接着$w回抽,反手轻点$n$1");
		setGesture(179, 2, 0, 0, 0, 15, 95, 0, 50, 0, 185, 99,"$N右腿半屈般蹲,一招「如封似闭」,捏了个剑诀,剑尖虚指,转身撩向$n的$1");
		setGesture(189, 2, 0, 5, 10, 0, 125, 0, 80, 0, 252, 99,"$N一招「燕子掠波」,$w自上而下划出一个大弧,平平地向$n挥去");
		setGesture(199, 2, 0, 15, 241, 241, 155, 0, 100, 0, 53, 100,"$N回身拧腰,右手虚抱,一招「拨云瞻日」,$w中宫直进,中正平和地刺向$n");//121
		setGesture(0, 4, 0, 0, 246, 246, 0, 0, 38, 2, 144, 100,"$N招式阴阳变化,忽地右拳翻出,左拳沉腰,发出太极刚劲,一式「搬拦锤」直向$n捶去");
		setGesture(0, 4, 0, 0, 246, 246, 0, 0, 38, 2, 219, 100,"$N招式阴阳变化,忽地左拳翻出,右拳沉腰,发出太极刚劲,一式「指掌锤」直向$n捶去");
		setGesture(0, 4, 0, 0, 5, 5, 0, 0, 20, 0, 2, 102,"$N接着一招「揽雀尾」,双手划了个半圈,左阴右阳,按向$n的前胸");                    //124
		setGesture(10, 2, 0, 0, 5, 5, 0, 0, 30, 0, 60, 102,"$N变招「提手上势」,两臂慢慢提起至胸前,左臂半环,右臂直伸,插向$n的左眼");
		setGesture(20, 2, 0, 0, 5, 5, 0, 0, 30, 0, 129, 102,"$N单脚独立,左手虚按,右手使一招「白鹤亮翅」,变拳成抓向$n的$1插去");
		setGesture(40, 4, 0, 0, 10, 10, 0, 0, 40, 0, 193, 102,"$N右臂半环,左手内旋,一招「手挥琶琶」,十指虚张,缓缓挥向$n的左臂");
		setGesture(40, 4, 0, 0, 5, 5, 0, 0, 40, 0, 0, 103,"$N右腿伸直,左手虚划,接着右臂外旋搬出一记「进步搬拦锤」击向$n的左脚");
		setGesture(60, 4, 0, 0, 10, 10, 0, 0, 50, 0, 67, 103,"$N右脚虚立,左手画圈后抚,一招「高探马」,右手圆转向前,朝$n面门挥去");
		setGesture(60, 4, 0, 0, 15, 15, 0, 0, 50, 0, 132, 103,"当下$N一招「斜飞势」,将$n力量引偏,双拳内划,合阴阳两股劲力推向$n");//130
		setGesture(70, 4, 0, 0, 5, 5, 0, 0, 60, 0, 196, 103,"$N左手变掌横于胸前,右手握拳由肘下穿出,一招「肘底看锤」,锤向$n的裆部");
		setGesture(80, 4, 0, 0, 10, 10, 0, 0, 60, 0, 8, 104,"$N左脚前踏半步,右手虚张使一招「海底针」,五指由下向上戳向$n的裆部");
		setGesture(90, 4, 0, 0, 0, 0, 0, 0, 70, 0, 73, 104,"$N进步虚踏,双手握拳划弧挥出,使一式「玉女穿梭」,顺着$n手臂直上,打向$n");
		setGesture(100, 4, 0, 0, 10, 10, 0, 0, 80, 0, 142, 104,"$N使出一招「云手」,左手高,右手低,一个圆圈已将$n全身套住,太极柔劲随即发出");
		setGesture(110, 4, 0, 0, 0, 0, 0, 0, 130, 0, 215, 104,"$N立半马步,坐腿、松胯、旋腰、扣膝,力发于腰,一招「马步靠」,靠向$n的前胸");
		setGesture(120, 4, 0, 0, 5, 5, 0, 0, 180, 0, 30, 105,"$N双手伸开,上身划出一个大圆弧,一招「转身摆莲」,将$n笼罩在重重太极圈中");
		setGesture(130, 4, 0, 0, 5, 5, 0, 0, 220, 0, 100, 105,"$N脚踏七星方位,左虚右,双拳交叉成十字,一招「进步七星」,向$n的右手推去");
		setGesture(140, 4, 0, 0, 10, 10, 0, 0, 250, 0, 169, 105,"$N施出「转身搬拦捶」,上体右转,右拳由下向上经左臂内侧搬向$n的前胸");
		setGesture(150, 4, 0, 0, 5, 5, 0, 0, 24, 1, 234, 105,"$N来个「野马分鬃」,转向$n身后,右前左后,两臂平伸在$n身上发劲一靠");
		setGesture(160, 4, 0, 0, 15, 15, 0, 0, 94, 1, 42, 106,"$N左右手臂外旋变掌,两手交叉,继而左右分开,成半招「如封似闭」推向$n前胸");
		setGesture(170, 4, 0, 0, 10, 10, 0, 0, 124, 1, 112, 106,"$N上体微右转,屈膝坐胯,出招「十字手」,两臂微内旋,分别向$n体两侧划弧发掌");//141
		setGesture(195, 106, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"只见$n一招「白鹤冲天」,身体向上笔直地纵起丈余,躲过了$N这一招");
		setGesture(0, 107, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一个「鹞子翻身」,向后纵出数丈之远,避开了$N的凌厉攻势");
		setGesture(55, 107, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n使出「大鹏展翅」,向一旁飘然纵出,轻轻着地");
		setGesture(98, 107, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「溪流归海」,一个抢步跨出数尺,避开$N这招");
		setGesture(145, 107, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n使一招「叶落归根」,上半身急向后仰,于间不容发之际闪了开去");                      //146
		setGesture(0, 1, 0, 0, 0, 0, 30, 0, 0, 0, 22, 108,"$N刀锋斜引,身体跃起丈许,一招「劈风展翅」,手中的$w向$n横劈过去");
		setGesture(0, 1, 0, 0, 0, 0, 40, 0, 0, 0, 84, 108,"$N一招「风拂山岗」,手中$w向$n的下盘划去,招未使老,忽又直挑其$1");
		setGesture(0, 1, 0, 5, 0, 0, 30, 0, 0, 0, 146, 108,"$N斜跨两步,抢到$n左侧,一招「抽刀断水」,自左向右平平横扫$n的$1");
		setGesture(0, 1, 0, 0, 0, 0, 45, 0, 0, 0, 208, 108,"$N一招「拨云见日」,向$n虚砍一刀,刀刃忽又转向$n的$1砍去");
		setGesture(0, 1, 0, 5, 0, 0, 50, 0, 0, 0, 7, 109,"$N身随刀进,青光闪跃,一招「苍鹰望月」,半途刀锋兜了个半圆,斜劈$n的右肩");
		setGesture(0, 1, 0, 10, 0, 0, 40, 0, 0, 0, 76, 109,"$N陡然身行飞起,一招「满天飞雪」,舞出万道刀光,向$n的$1掠去");                      //152
		setGesture(148, 109, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n一招「夕阳残雪」轻轻巧巧地避了开去");
		setGesture(185, 109, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"只见$n身影一晃,一式「开阳薄雾」早已避在七尺之外");
		setGesture(233, 109, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n使出「信步闲庭」,轻轻松松地闪过");
		setGesture(11, 110, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n左足一点,一招「万里雪飘」腾空而起,避了开去");
		setGesture(56, 110, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"可是$n使一招「踏雪无痕」,身子轻轻飘了开去");
		setGesture(98, 110, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$n身影微动,已经藉一招「雪影无踪」轻轻闪过");                                                 //158
		setGesture(0, 2, 0, 0, 0, 0, 20, 0, 0, 0, 190, 110,"$N双手握剑,一招「朝天式」奋力刺向$n的上盘");
		setGesture(0, 2, 0, 0, 0, 0, 20, 0, 0, 0, 232, 110,"$N使一招「望月式」,撤剑拧身,翻身直刺$n的中盘");
		setGesture(0, 1, 0, 0, 0, 0, 25, 0, 0, 0, 21, 111,"$N大喝一声,一招「切藕式」,竟以剑作刀,猛力斜劈而下");
		setGesture(0, 1, 0, 0, 0, 0, 20, 0, 0, 0, 71, 111,"$N剑尖斜指,舞个剑花,忽地一招「抢地式」,反挑$n的下盘");                                  //162
		setGesture(0, 2, 0, 0, 0, 0, 30, 0, 0, 0, 245, 111,"$N腰身微躬,$w斜指,乃是七十二路雪山剑法的起手式「老梅迎客」");
		setGesture(30, 2, 0, 2, 0, 0, 40, 0, 0, 0, 48, 112,"$N剑尖倏地翻上,斜斜刺向$n$1,正是雪山剑法中的一招「老枝横斜」");
		setGesture(40, 2, 0, 5, 0, 0, 45, 0, 0, 0, 109, 112,"$N忽地发足急奔,直冲到$n面前,电光火时间一招「明驼骏足」猛地刺出");
		setGesture(60, 1, 0, 3, 0, 0, 50, 0, 0, 0, 172, 112,"$N剑光闪动,一招「云横西岭」,一片剑幕斜斜罩向$n");
		setGesture(70, 2, 0, 5, 0, 0, 50, 0, 0, 0, 219, 112,"$N横剑胸前,忽地一招「明月羌笛」,剑带笛音,直刺$n$1");
		setGesture(80, 1, 0, 7, 0, 0, 60, 0, 0, 0, 13, 113,"$N一招「暗香疏影」,剑式错落,剑刃若有若无的斜削过来");
		setGesture(95, 2, 0, 7, 0, 0, 60, 0, 0, 0, 64, 113,"$N,抢上三步,一式「雪泥鸿爪」挺剑刺出,谁料中途突然变招,带转剑锋,斜削敌喉");
		setGesture(90, 2, 0, 5, 0, 0, 80, 0, 0, 0, 136, 113,"$N一招「月色昏黄」,使得若有若无,蒙蒙胧胧,当真是得了雪山剑法的神髓");
		setGesture(110, 2, 0, 8, 0, 0, 80, 0, 0, 0, 202, 113,"$N横劈斜刺,一瞬间不知刺出多少剑,这招「风沙莽莽」真有天地变色之势");
		setGesture(130, 2, 0, 10, 0, 0, 90, 0, 0, 0, 11, 114,"$N一招「梅雪争春」,剑尖剑锋齐用,剑尖是雪点,剑锋乃梅枝,向$n错落攻来");    //172
		setGesture(0, 3, 0, 0, 0, 0, 0, 0, 110, 0, 176, 114,"$N一招「长者折梅」,双掌簸张,夹着一阵寒气直取$n$1");
		setGesture(19, 3, 0, 0, 0, 0, 0, 0, 120, 0, 225, 114,"$N一招「拨云见日」,左掌划个圈子,右手变掌成抓,倏地从圈中击出");
		setGesture(39, 3, 0, 5, 0, 0, 0, 0, 150, 0, 29, 115,"$N使一招「漫天飞雪」,双掌上下飞舞,夹杂着冰雪之势直取$n咽喉");
		setGesture(60, 1, 0, 10, 0, 0, 0, 0, 150, 0, 88, 115,"$N逆运雪山心,法脸露笑容,一招「冰谷初阳」从不可思议的角度抓向$n");
		setGesture(70, 3, 0, 5, 0, 0, 0, 0, 180, 0, 151, 115,"$N一招「飞雪如虹」,忽地转到$n身后,直取$n背心灵台穴");
		setGesture(85, 3, 0, 5, 251, 0, 0, 0, 180, 0, 202, 115,"$N左手成鹰爪右手成鹤啄,忽地右手翻为虎爪左手变为龙形,正是那招「风翻云变」");
		setGesture(95, 3, 0, 0, 0, 0, 0, 0, 200, 0, 19, 116,"$N展动身形使出「雪落无声」,高高跃起,轻飘飘地一掌击向$n");
		setGesture(110, 3, 0, 10, 251, 251, 0, 0, 250, 0, 74, 116,"$N双掌变得雪白,一招「冰封地彻」攻向$n,一时间$n上盘七处要穴堪忧"); //180
		setGesture(0, 3, 0, 5, 251, 251, 0, 0, 100, 0, 15, 117,"$N一式「虎膝击」，左膝刚至右膝又到，竟欲将$n击飞");
		setGesture(19, 3, 0, 5, 0, 0, 0, 0, 120, 0, 64, 117,"$N急退几步，忽地一招「恶虎翻身」，返身两拳击向$n的$1");
		setGesture(39, 4, 0, 8, 251, 251, 0, 0, 120, 0, 117, 117,"$N一招「猛虎硬上山」，一拳击向$n，气势汹涌，莫可抵御");
		setGesture(49, 1, 0, 8, 251, 251, 0, 0, 150, 0, 170, 117,"$N双拳交错，一招「猛虎剪手」奋力击出，直欲将$n剪为两段");
		setGesture(69, 3, 0, 5, 246, 246, 0, 0, 180, 0, 225, 117,"$N一招「黄金之踵落」，高高跃起，一腿疾踢向$n的$1，破空之声大作");
		setGesture(79, 3, 0, 10, 251, 251, 0, 0, 200, 0, 32, 118,"$N使一招「恶虎拦路」，封住$n全部退路，紧跟着一拳当胸打到");
		setGesture(89, 3, 0, 10, 246, 246, 0, 0, 240, 0, 89, 118,"$N虎吼一声，使一招「猛虎上升拳」，肩肘腕胯膝竟无一处不可伤敌");
		setGesture(99, 4, 0, 2, 251, 251, 0, 0, 240, 0, 150, 118,"$N暗运真气，使一招「龙虎破」，携一股灼热内力向$n猛击而来");
		setGesture(109, 4, 0, 5, 251, 251, 0, 0, 4, 1, 207, 118,"$N一式「死亡旋风」，将一股强劲内力形成漩涡，呼啸向$n击去");
		setGesture(119, 3, 0, 10, 246, 246, 0, 0, 24, 1, 8, 119,"$N使一招「猛虎摆尾」，转身踢腿，一腿接一腿向$n下盘猛攻八招");
		setGesture(129, 3, 0, 15, 244, 244, 0, 0, 64, 1, 67, 119,"$N呼喝一声，一招「虎烈杀」拳肘齐施，如狂风暴雨般向$n连攻十六拳"); //191
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N对准$n的$1用力挥出一拳。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N提起拳头往$n的$1捶去。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N挥拳攻击$n的$1。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N往$n的$1狠狠踢了一脚。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N往$n的$1一抓。");                                                                   //196
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N挥舞$w，对准$n的$1一阵乱砍。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N用$w往$n的$1砍去。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N挥动$w，斩向$n的$1。");                                                      //199
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N用$w往$n的$1刺去。");                                                           //200
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N手握$w，眼露凶光，猛地对准$n的$1挥了过去。");              
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N高高举起$w，往$n的$1当头砸下。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"$N挥舞$w，往$n的$1用力一击。");                                         //202（对）
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"但是$n身子一侧，用手中兵刃架开。");        
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"只听见“将”一声，被$n格开了。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"但是被$n用手中兵刃架开。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"结果“当”地一声，被$n挡开了。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"结果被$n挡开了。");                                                                  //208
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"但是被$n机灵地躲开了。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"但是和$n的$1偏了几寸。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"但是$n身子一侧，闪了开去。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"但是$n已有准备，不慌不忙地躲开。");
		setGesture(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,"但是被$n及时地避开。");                                                         //213
		
		b = false;
	}
}
