/**
 * 安卓白金英雄坛制作组 <p>
 * 文件名：Item.java <p>
 * 创建时间：2013-7-27 下午10:38:20 <p>
 * 所属项目：GmudTest <p>
 * @author 12548 <p>
 */
package lostland.gumd.platinum12548.data;

import lostland.gumd.platinum12548.GmudWorld;

/**
 * 类名：Item <p>
 * 说明：
 * @author 12548
 */
public class Item {

	// [82]
	public static final String item_names[] = new String[]{
		"none", "烤鸡腿", "包子", "酥油茶", "翡翠豆腐", "猪肉", "糖葫芦", "白玉豆腐", "金创药", "生肌膏", 
		"海外仙丹", "钢刀", "菜刀", "匕首", "檀香扇", "护手钩", "杀猪刀", "长剑", "缝衣针", "麻绳", 
		"园工剪", "钢杖", "长鞭", "鬼头刀", "紫金刀", "梨花鞭", "拂尘", "柳玉刀", "红拂", "白玉萧", 
		"花碟扇", "河豚毒", "精钢杖", "青锋剑", "铁拐", "铁剑", "楚妃剑", "凝碧剑", "细剑", "黑衣", 
		"老花镜", "绿牡丹", "布衣", "精制布衣", "皮背心", "粉红绸衫", "红杜鹃", "绣花小鞋", "白玫瑰", "茶花", 
		"轻花绸衫", "洒花缎鞋", "宝蓝缎衫", "夜行衣", "绿水罗衣", "轻纱长裙", "黑眼罩", "披风", "武道服", "道袍", 
		"白罗袍", "绸袍", "金锁子甲", "降魔袍", "霓虹羽衣", "雪山白袍", "亮银甲", "豹皮", "拳经", "焦黄纸页", 
		"惊天刀谱", "手抄本", "毛笔", "钓杆", "鲤鱼", "牛皮束带", "鱼篓", "三角石板", "女儿红", "屠龙刀", 
		"绣花针", "菜花宝典"
	};

	public static final String item_desc[] = new String[]{
		"12548",
		"一支烤得香喷喷的鸡腿,你还犹豫什麼？ ",
		"一个香喷喷、热腾腾的大包子 ",
		"这是雪山特产,喝起来是既解渴又解饿 ",
		"一块青翠碧绿的大豆腐 ",
		"上好的猪肉,肯定是没注过水的 ",
		"一串可口的糖葫芦,小孩最爱吃",
		"一块白白嫩嫩的大豆腐",
		"由田七,血竭等药材配制的药剂,专治跌打损伤刀伤烫伤 ",
		"一盒黑油油的药膏,闻上去有一股辛辣清凉的味道,令人精神一振",
		"这是一颗晶莹光洁的丹药,据说是虯髯客采海外精华提炼而成 ",
		"一把精钢打制的砍刀,看样子有十来斤左右",
		"一把锋利的菜刀,看来是用上好的原料打造的,也是件不错的武器",
		"这是一把看起相当普通的匕首",
		"这是一把不错的扇子,由硬檀香木制做,扇动时有股淡淡的香味",
		"这柄钩闪烁著寒光,看来甚是锋利,没有手柄,虽用起来有些不变,但却灵活异常",
		"这是一把很锋利的钢刀",
		"这是一把看起相当普通的长剑,份量大约有十来斤左右",
		"一种上等铁做成的缝衣针",
		"一捆结实的绳子,要是勒在脖子上,必死无疑 ",
		"一把长而锋利的园工剪刀",
		"这是一件精钢制成的杖",
		"一条普通的长鞭",
		"这把刀入手沉重,刀背上雕有一个狰狞鬼头,鬼头口衔金环,舞动时撞击刀身发出刺耳的声音",
		"这柄刀紫光闪闪,冷气森森,是一柄厚背薄刃紫金八卦刀",
		"这条鞭上棱角嶙峋,犹如雨后露珠,鞭身上镂空有梨花之形,正是李青照的成名兵器",
		"这柄拂尘看上去没什么特别,可尘尾却夹有钢丝,竟可以当软鞭使用 ",
		"这是一把通体碧绿的弯刀,竟如同碧玉雕成.虽然分量不重,但非常称手",
		"这是红拂女不离手的拂尘,尘尾由雪山蛛丝夹杂金丝绞成,是一条厉害的软鞭",
		"这支萧由通体晶莹圆润的白玉制成,竟是一把称手的武器",
		"这把扇子的扇骨是精钢打制的,展开时缘如利刃,乃是一把扇刀 ",
		"这是藤王丸成名的宝刀,刀身狭长且直,两侧各有古朴花纹,入手沉甸甸",
		"的一条又粗又长的精钢禪杖,上面镶著三个铜环",
		"这是一把又细又长的剑,剑身锐利",
		"一条铁拐,看起来黑黝黝的,分量肯定不轻",
		"一把锈迹驳驳的铁剑,但相当的锋利 ",
		"一把淡绿色的细剑,看起来非常的华丽",
		"一把淡蓝色的细剑,剑身几乎透明,剑锋处闪著点点寒光,似乎喂了剧毒",
		"一柄剑身窄细的长剑,只有两指来宽,却甚為锋利",
		"是一件黑油油的衣服,也不知是用什么布料做成的,摸上去十分柔软,可又十分坚韧",
		"一副老花镜,戴上去试试看,一些东西变得清楚了 ",
		"一朵成熟冷静的绿牡丹",
		"一件很普通的布衣",
		"一件做工精细的布衣",
		"用熟牛皮制作的背心,看起来满结实的,就算用匕首也很难划破",
		"这件粉红色的绸衫上面绣著几只黄鹊,闻起来还有一股淡香",
		"一朵热烈绽放的红杜鹃",
		"一双女孩子穿的绣花鞋",
		"一朵神秘高贵的白玫瑰",
		"一株生机勃勃的茶花",
		"这是用当时的提花术织成的绸衣,轻飘飘的,上面有若隐若现的花纹",
		"一双缎面洒金花的女鞋,小巧玲瓏十分可爱",
		"这件宝蓝色缎衫上用苏绣点缀著青白色的梅花,十分雅致",
		"这是一袭紧身短打扮的夜行衣,剪裁十分合身,穿上动作十分利索",
		"一条朦朦胧胧的纱裙,闻起来还有一股淡香",
		"这是一件看起来非常典雅的长裙,却不知是什么制成",
		"十兵卫请人特制的眼罩",
		"一件印有龟仙派标记的披风,穿在身上象鸟的翅膀",
		"一件印有龟仙派标记的武道服,又轻又耐穿",
		"一件道袍,上面画有一个太极阴阳鱼",
		"一件白色的粗布袍,虽然质的并不好,但裁剪精细,看起来别有风姿",
		"一件丝绸长袍,质的和裁剪都不错",
		"一件金线织就的宝甲",
		"道士作法降魔时穿的道袍",
		"一件采集百禽羽毛一片片的穿成的衣裳,黑的是鹰毛,白的是雁翎",
		"一件丝制白袍,当胸绣著一只飞扬欲脱的大鹏鸟",
		"一件银光灿灿的盔甲",
		"一块色彩斑斓的豹皮,围在身上暖洋洋的",
		"这是一本年代久远的拳经,前两页是扎根入门的功夫,后面详细讲解了拳法的精义 ",
		"这是两张焦黄的纸页,上面有一些奇怪的图形,画了一些拳脚招式,可看起来又怪又笨拙",
		"得很这是一本讲解刀法总纲的书,里面有不少图解和文字,深入浅出的讲了不少精义",
		"这本书上满是字体娟秀的蝇头小楷,记录了经脉运行和打坐周天的诸般法门",
		"一支毛笔,湘妃竹的笔杆,笔头上还有用过的墨跡",
		"一支钓杆,做工精良,很有韧性,是钓鱼的利器",
		"一条活蹦乱跳的大鲤鱼",
		"用非常结实的牛皮制成的腰带",
		"一个草编的鱼篓,专门用来装鱼的",
		"三角形状的石板,年代相当久远。",
		"上好的美酒,据说喝一瓶能醉上三个月。",
		"古人用来杀龙的刀,可以一击必杀,对人的效果不明",
		"传说是用定海神珍铁磨成的绣花针",
	"曾经在武林中引起血雨腥风的武功密籍，首页写着：欲练此功，必先自……"};



	// 物品属性!!
	// 0食物，0，+food，+water，0，0，cost
	// 1药物，type，+效果1，0，0，0，cost
	// 2武器，type，+攻击，+命中，+回避，0，cost (weapon type 1刀 6剑 7杖 9鞭)
	// 3装备，type，+防御，+命中，+回避，0，cost  (equip type 0饰品 2衣 3背心 4披风 5腰带 9钓竿 10鞋)
	// 4书籍， 0，type，require HP，max_level，require EXP，cost
	// 5其他， 0, 0，0，0，0，cost
	static final int item_attribs[][] = new int[][] {
		// none
		{0, 0, 0, 0, 0, 0, 0},
		// 烤鸡腿
		{0, 0, 160, 0, 0, 0, 30},
		// 包子
		{0, 0, 120, 0, 0, 0, 20},
		// 酥油茶
		{0, 0, 180, 200, 0, 0, 150},
		// 翡翠豆腐
		{0, 0, 160, 0, 0, 0, 55},
		// 猪肉
		{0, 0, 240, 0, 0, 0, 100},
		// 糖葫芦
		{0, 0, 60, 0, 0, 0, 50},
		// 白玉豆腐
		{0, 0, 80, 0, 0, 0, 35},
		// 金创药
		{1, 0, 0, 0, 0, 0, 2000},
		// 生肌膏
		{1, 0, 1, 0, 0, 0, 3000},
		// 海外仙丹
		{1, 1, 5, 0, 0, 0, 3000},
		// 钢刀
		{2, 1, 25, 0, -1, 0, 600},
		// 菜刀
		{2, 1, 17, 0, 0, 0, 100},
		// 匕首
		{2, 6, 5, 0, 0, 0, 50},
		// 檀香扇
		{2, 6, 15, 0, 0, 0, 1500},
		// 护手钩
		{2, 1, 55, 5, -3, 0, 30000},
		// 杀猪刀
		{2, 1, 25, 0, 0, 0, 1000},
		// 长剑
		{2, 6, 25, 0, -1, 0, 600},
		// 缝衣针
		{2, 6, 10, 0, 0, 0, 70},
		// 麻绳
		{2, 9, 1, 0, 0, 0, 0},
		// 园工剪
		{2, 6, 15, 0, 0, 0, 1000},
		// 钢杖
		{2, 7, 28, 0, -2, 0, 700},
		// 长鞭
		{2, 9, 20, 0, 0, 0, 500},
		// 鬼头刀
		{2, 1, 35, 3, 0, 0, 800},
		// 紫金刀
		{2, 1, 55, 0, -2, 0, 20000},
		// 梨花鞭
		{2, 9, 70, 0, -2, 0, 34464},
		// 拂尘
		{2, 9, 35, 0, 0, 0, 20000},
		// 柳玉刀
		{2, 1, 40, 0, -1, 0, 20000},
		// 红拂
		{2, 9, 55, 0, -1, 0, 40000},
		// 白玉萧
		{2, 6, 15, 0, 0, 0, 5500},
		// 花蝶扇
		{2, 1, 35, 0, 0, 0, 9464},
		// 河豚毒
		{2, 1, 55, 0, -2, 0, 50000},
		// 精钢杖
		{2, 7, 35, 0, 0, 0, 5000},
		// 青锋剑
		{2, 6, 65, 0, 0, 0, 7000},
		// 铁拐
		{2, 7, 20, 0, 0, 0, 1000},
		// 铁剑
		{2, 6, 30, 0, 0, 0, 1000},
		// 楚妃剑
		{2, 6, 45, 0, 0, 0, 10000},
		// 凝碧剑
		{2, 6, 60, 0, 0, 0, 30000},
		// 细剑
		{2, 6, 30, 0, 0, 0, 700},
		// 黑衣
		{3, 2, 45, 0, 3, 0, 50000},
		// 老花镜
		{3, 0, 0, 0, 0, 0, 100},
		// 绿牡丹
		{3, 0, 0, 0, 0, 0, 20},
		// 布衣
		{3, 2, 5, 0, 0, 0, 8},
		// 精制布衣
		{3, 2, 15, 0, 0, 0, 500},
		// 皮背心
		{3, 3, 15, 0, -1, 0, 1000},
		// 粉红绸衫
		{3, 2, 10, 0, 0, 0, 600},
		// 红杜鹃
		{3, 0, 0, 0, 0, 0, 20},
		// 绣花小鞋
		{3, 10, 5, 0, 0, 0, 300},
		// 白玫瑰
		{3, 0, 0, 0, 0, 0, 20},
		// 茶花
		{3, 0, 0, 0, 0, 0, 40},
		// 轻花绸衫
		{3, 2, 8, 0, 0, 0, 100},
		// 洒花缎鞋
		{3, 10, 10, 0, 3, 0, 300},
		// 宝蓝缎衫
		{3, 2, 0, 0, 10, 0, 300},
		// 夜行衣
		{3, 2, 0, 0, 6, 0, 14464},
		// 渌水罗衣
		{3, 2, 10, 0, 5, 0, 1500},
		// 轻纱长裙
		{3, 2, 1, 0, 0, 0, 10},
		// 黑眼罩
		{3, 0, 3, 3, 0, 0, 100},
		// 披风
		{3, 4, 5, 0, 2, 0, 2000},
		// 武道服
		{3, 2, 5, 5, 0, 0, 500},
		// 道袍
		{3, 2, 5, 0, 0, 0, 300},
		// 白罗袍
		{3, 2, 15, 0, 0, 0, 400},
		// 绸袍
		{3, 2, 4, 0, 0, 0, 600},
		// 金锁子甲
		{3, 3, 60, 0, -5, 0, 10000},
		// 降魔袍
		{3, 3, 10, 0, 5, 0, 2000},
		// 霓虹羽衣
		{3, 2, 10, 0, 8, 0, 3000},
		// 雪山白袍
		{3, 2, 4, 0, 0, 0, 600},
		// 亮银甲
		{3, 3, 45, 0, -3, 0, 5000},
		// 豹皮
		{3, 3, 40, 0, 0, 0, 5000},
		// 拳经
		{4, 0, 191, 60, 0, 0, 500},
		// 焦黄纸页
		{4, 0, 196, 60, 0, 0, 150},
		// 惊天刀谱
		{4, 0, 201, 60, 0, 0, 150},
		// 手抄本
		{4, 0, 206, 60, 0, 0, 100},
		// 毛笔
		{5, 0, 0, 0, 0, 0, 50},
		// 钓杆
		{3, 9, 0, 0, 0, 0, 300},
		// 鲤鱼
		{0, 0, 250, 0, 0, 0, 250},
		// 牛皮束带
		{3, 5, 2, 0, 2, 0, 5000},
		// 鱼篓
		{5, 0, 0, 0, 0, 0, 100},
		// 三角石板
		{5, 0, 0, 0, 0, 0, 0},
		// 女儿红
		{5, 0, 0, 0, 0, 0, 380},
		// 屠龙刀
		{2, 1, 88, 5, -10, 0, 30000},
		// 绣花针
		{2, 6, 99, 10, 5, 0, 50000},
		// 菜花宝典
		{4, 0, 211, 60, 0, 0, 0}
	};





	public static int ROPE_INDEX = 19;

	public int id;
	public int kind;
	public int subkind;
	public String name;

	public int a3,a4,a5,a6;

	public int cost;

	public String des = "尚无描述";

	/**
	 * 
	 */
	public Item() {
		// TODO 自动生成的构造函数存根
	}


	public static void init()
	{
		int i;
		for(i=0;i<82;i++)
		{
			GmudWorld.wp[i] = new Item();
			GmudWorld.wp[i].id = i;
			GmudWorld.wp[i].name = item_names[i];
			GmudWorld.wp[i].kind = item_attribs[i][0];
			GmudWorld.wp[i].subkind = item_attribs[i][1];
			GmudWorld.wp[i].a3 = item_attribs[i][2];
			GmudWorld.wp[i].a4 = item_attribs[i][3];
			GmudWorld.wp[i].a5 = item_attribs[i][4];
			GmudWorld.wp[i].a6 = item_attribs[i][5];
			GmudWorld.wp[i].cost = item_attribs[i][6];
			GmudWorld.wp[i].des = item_desc[i];
		}
	}

	public static int getitmnpc(int itmid)
	{
		switch(itmid)
		{
		case 68: // 拳经
			return GmudWorld.npc.length - 2;
		case 69: // 焦黄纸页
			return GmudWorld.npc.length - 3;
		case 70:
			return GmudWorld.npc.length - 4;
		case 71:
			return GmudWorld.npc.length - 5;
		case 81:
			return GmudWorld.npc.length - 6;
		default:
			return 0;
		}
	}


}
