/**
 * 安卓白金英雄坛制作组 <p>
 * 文件名：Item.java <p>
 * 创建时间：2013-7-27 下午10:38:20 <p>
 * 所属项目：GmudTest <p>
 * @author 12548 <p>
 */
package lostland.gumd.platinum12548.data;

import lostland.gumd.platinum12548.GmudWorld;

/**
 * 类名：Item <p>
 * 说明：
 * @author 12548
 */
public class Item {

	// [82]
	static final String item_names[] = new String[]{
		"none", "烤鸡腿", "包子", "酥油茶", "翡翠豆腐", "猪肉", "糖葫芦", "白玉豆腐", "金创药", "生肌膏", 
		"海外仙丹", "钢刀", "菜刀", "匕首", "檀香扇", "护手钩", "杀猪刀", "长剑", "缝衣针", "麻绳", 
		"园工剪", "钢杖", "长鞭", "鬼头刀", "紫金刀", "梨花鞭", "拂尘", "柳玉刀", "红拂", "白玉萧", 
		"花碟扇", "河豚毒", "精钢杖", "青锋剑", "铁拐", "铁剑", "楚妃剑", "凝碧剑", "细剑", "黑衣", 
		"老花镜", "绿牡丹", "布衣", "精制布衣", "皮背心", "粉红绸衫", "红杜鹃", "绣花小鞋", "白玫瑰", "茶花", 
		"轻花绸衫", "洒花缎鞋", "宝蓝缎衫", "夜行衣", "绿水罗衣", "轻纱长裙", "黑眼罩", "披风", "武道服", "道袍", 
		"白罗袍", "绸袍", "金锁子甲", "降魔袍", "霓虹羽衣", "雪山白袍", "亮银甲", "豹皮", "拳经", "焦黄纸页", 
		"惊天刀谱", "手抄本", "毛笔", "钓杆", "鲤鱼", "牛皮束带", "鱼篓", "三角石板", "女儿红", "屠龙刀", 
		"绣花针", "菜花宝典"
		};
	
	// 物品属性!!
	// 0食物，0，+food，+water，0，0，cost
	// 1药物，type，+效果1，0，0，0，cost
	// 2武器，type，+攻击，+命中，+回避，0，cost (weapon type 1刀 6剑 7杖 9鞭)
	// 3装备，type，+防御，+命中，+回避，0，cost  (equip type 0饰品 2衣 3背心 4披风 5腰带 9钓竿 10鞋)
	// 4书籍， 0，type，require HP，max_level，require EXP，cost
	// 5其他， 0, 0，0，0，0，cost
	static final int item_attribs[][] = new int[][] {
		// none
		{0, 0, 0, 0, 0, 0, 0},
		// 烤鸡腿
		{0, 0, 160, 0, 0, 0, 30},
		// 包子
		{0, 0, 120, 0, 0, 0, 20},
		// 酥油茶
		{0, 0, 180, 200, 0, 0, 150},
		// 翡翠豆腐
		{0, 0, 160, 0, 0, 0, 55},
		// 猪肉
		{0, 0, 240, 0, 0, 0, 100},
		// 糖葫芦
		{0, 0, 60, 0, 0, 0, 50},
		// 白玉豆腐
		{0, 0, 80, 0, 0, 0, 35},
		// 金创药
		{1, 0, 0, 0, 0, 0, 2000},
		// 生肌膏
		{1, 0, 1, 0, 0, 0, 3000},
		// 海外仙丹
		{1, 1, 5, 0, 0, 0, 3000},
		// 钢刀
		{2, 1, 25, 0, -1, 0, 600},
		// 菜刀
		{2, 1, 17, 0, 0, 0, 100},
		// 匕首
		{2, 6, 5, 0, 0, 0, 50},
		// 檀香扇
		{2, 6, 15, 0, 0, 0, 1500},
		// 护手钩
		{2, 1, 55, 5, -3, 0, 30000},
		// 杀猪刀
		{2, 1, 25, 0, 0, 0, 1000},
		// 长剑
		{2, 6, 25, 0, -1, 0, 600},
		// 缝衣针
		{2, 6, 10, 0, 0, 0, 70},
		// 麻绳
		{2, 9, 1, 0, 0, 0, 0},
		// 园工剪
		{2, 6, 15, 0, 0, 0, 1000},
		// 钢杖
		{2, 7, 28, 0, -2, 0, 700},
		// 长鞭
		{2, 9, 20, 0, 0, 0, 500},
		// 鬼头刀
		{2, 1, 35, 3, 0, 0, 800},
		// 紫金刀
		{2, 1, 55, 0, -2, 0, 20000},
		// 梨花鞭
		{2, 9, 70, 0, -2, 0, 34464},
		// 拂尘
		{2, 9, 35, 0, 0, 0, 20000},
		// 柳玉刀
		{2, 1, 40, 0, -1, 0, 20000},
		// 红拂
		{2, 9, 55, 0, -1, 0, 40000},
		// 白玉萧
		{2, 6, 15, 0, 0, 0, 5500},
		// 花蝶扇
		{2, 1, 35, 0, 0, 0, 9464},
		// 河豚毒
		{2, 1, 55, 0, -2, 0, 50000},
		// 精钢杖
		{2, 7, 35, 0, 0, 0, 5000},
		// 青锋剑
		{2, 6, 65, 0, 0, 0, 7000},
		// 铁拐
		{2, 7, 20, 0, 0, 0, 1000},
		// 铁剑
		{2, 6, 30, 0, 0, 0, 1000},
		// 楚妃剑
		{2, 6, 45, 0, 0, 0, 10000},
		// 凝碧剑
		{2, 6, 60, 0, 0, 0, 30000},
		// 细剑
		{2, 6, 30, 0, 0, 0, 700},
		// 黑衣
		{3, 2, 45, 0, 3, 0, 50000},
		// 老花镜
		{3, 0, 0, 0, 0, 0, 100},
		// 绿牡丹
		{3, 0, 0, 0, 0, 0, 20},
		// 布衣
		{3, 2, 5, 0, 0, 0, 8},
		// 精制布衣
		{3, 2, 15, 0, 0, 0, 500},
		// 皮背心
		{3, 3, 15, 0, -1, 0, 1000},
		// 粉红绸衫
		{3, 2, 10, 0, 0, 0, 600},
		// 红杜鹃
		{3, 0, 0, 0, 0, 0, 20},
		// 绣花小鞋
		{3, 10, 5, 0, 0, 0, 300},
		// 白玫瑰
		{3, 0, 0, 0, 0, 0, 20},
		// 茶花
		{3, 0, 0, 0, 0, 0, 40},
		// 轻花绸衫
		{3, 2, 8, 0, 0, 0, 100},
		// 洒花缎鞋
		{3, 10, 10, 0, 3, 0, 300},
		// 宝蓝缎衫
		{3, 2, 0, 0, 10, 0, 300},
		// 夜行衣
		{3, 2, 0, 0, 6, 0, 14464},
		// 渌水罗衣
		{3, 2, 10, 0, 5, 0, 1500},
		// 轻纱长裙
		{3, 2, 1, 0, 0, 0, 10},
		// 黑眼罩
		{3, 0, 3, 3, 0, 0, 100},
		// 披风
		{3, 4, 5, 0, 2, 0, 2000},
		// 武道服
		{3, 2, 5, 5, 0, 0, 500},
		// 道袍
		{3, 2, 5, 0, 0, 0, 300},
		// 白罗袍
		{3, 2, 15, 0, 0, 0, 400},
		// 绸袍
		{3, 2, 4, 0, 0, 0, 600},
		// 金锁子甲
		{3, 3, 60, 0, -5, 0, 10000},
		// 降魔袍
		{3, 3, 10, 0, 5, 0, 2000},
		// 霓虹羽衣
		{3, 2, 10, 0, 8, 0, 3000},
		// 雪山白袍
		{3, 2, 4, 0, 0, 0, 600},
		// 亮银甲
		{3, 3, 45, 0, -3, 0, 5000},
		// 豹皮
		{3, 3, 40, 0, 0, 0, 5000},
		// 拳经
		{4, 0, 191, 60, 0, 0, 500},
		// 焦黄纸页
		{4, 0, 196, 60, 0, 0, 150},
		// 惊天刀谱
		{4, 0, 201, 60, 0, 0, 150},
		// 手抄本
		{4, 0, 206, 60, 0, 0, 100},
		// 毛笔
		{5, 0, 0, 0, 0, 0, 50},
		// 钓杆
		{3, 9, 0, 0, 0, 0, 300},
		// 鲤鱼
		{0, 0, 250, 0, 0, 0, 250},
		// 牛皮束带
		{3, 5, 2, 0, 2, 0, 5000},
		// 鱼篓
		{5, 0, 0, 0, 0, 0, 100},
		// 三角石板
		{5, 0, 0, 0, 0, 0, 0},
		// 女儿红
		{5, 0, 0, 0, 0, 0, 380},
		// 屠龙刀
		{2, 1, 88, 5, -10, 0, 30000},
		// 绣花针
		{2, 6, 99, 10, 5, 0, 50000},
		// 菜花宝典
		{4, 0, 211, 60, 0, 0, 0}
	};

	
	
	
	
	public static int ROPE_INDEX = 19;
	
	public int id;
	public int kind;
	public int subkind;
	public String name;
	
	public int a3,a4,a5,a6;
	
	public int cost;
	
	public String des = "尚无描述";
	
	/**
	 * 
	 */
	public Item() {
		// TODO 自动生成的构造函数存根
	}

	
	public static void init()
	{
		int i;
		for(i=0;i<82;i++)
		{
			GmudWorld.wp[i] = new Item();
			GmudWorld.wp[i].id = i;
			GmudWorld.wp[i].name = item_names[i];
			GmudWorld.wp[i].kind = item_attribs[i][0];
			GmudWorld.wp[i].subkind = item_attribs[i][1];
			GmudWorld.wp[i].a3 = item_attribs[i][2];
			GmudWorld.wp[i].a4 = item_attribs[i][3];
			GmudWorld.wp[i].a5 = item_attribs[i][4];
			GmudWorld.wp[i].a6 = item_attribs[i][5];
			GmudWorld.wp[i].cost = item_attribs[i][6];
		}
	}


}
